#+TITLE:  Hi there 👋
#+AUTHOR: sadsnake42
#+DATE:   2021-08-19
#+DESCRIPTION: Mikhail Gorbachev github profile description
#+LANGUAGE:  en

Welcome to my profile! Enjoy this [[https://en.wikipedia.org/wiki/Fizz_buzz][FizzBuzz]] implementation and make yourself at home!

#+BEGIN_SRC rust
const NUMS: [&str; 101] = [
    "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16",
    "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32",
    "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48",
    "49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59", "60", "61", "62", "63", "64",
    "65", "66", "67", "68", "69", "70", "71", "72", "73", "74", "75", "76", "77", "78", "79", "80",
    "81", "82", "83", "84", "85", "86", "87", "88", "89", "90", "91", "92", "93", "94", "95", "96",
    "97", "98", "99", "100",
];

fn main() {
    (1..=100u32)
        .map(|n| match n.pow(4) % 15 {
            0 => "FizzBuzz",
            6 => "Fizz",
            10 => "Buzz",
            _ => NUMS[n as usize],
        })
        .for_each(|s| print!("{},", s));
}
#+END_SRC

#+RESULTS:
: 1,2,Fizz,4,Buzz,Fizz,7,8,Fizz,Buzz,11,Fizz,13,14,FizzBuzz,16,17,Fizz,19,Buzz,Fizz,22,23,Fizz,Buzz,26,Fizz,28,29,FizzBuzz,31,32,Fizz,34,Buzz,Fizz,37,38,Fizz,Buzz,41,Fizz,43,44,FizzBuzz,46,47,Fizz,49,Buzz,Fizz,52,53,Fizz,Buzz,56,Fizz,58,59,FizzBuzz,61,62,Fizz,64,Buzz,Fizz,67,68,Fizz,Buzz,71,Fizz,73,74,FizzBuzz,76,77,Fizz,79,Buzz,Fizz,82,83,Fizz,Buzz,86,Fizz,88,89,FizzBuzz,91,92,Fizz,94,Buzz,Fizz,97,98,Fizz,Buzz,
